Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: Here, we’ll review a few basic tools for undoing changes that you’ve made.
cs: Podívejme se proto, jaké základní nástroje se nám tu nabízejí.

source: Here, we’ll show you some of the most-used options.
cs: Ukážeme si některé z nejpoužívanějších možností.

source: Here, we’re assuming that you have wildcard DNS set up to send `*.gitserver` to whatever box you’re using to run all this:
cs: Tady předpokládáme, že máte nastaveny zástupné znaky DNS (wildcard DNS) a můžete odeslat `*.gitserver` do kteréhokoli boxu, který používáte, a spustit následující:

source: Here, you’ll look at a few interactive commands that can help you easily craft your commits to include only certain combinations and parts of files.
cs: V této části se podíváme na několik interaktivních příkazů, které vám mohou pomoci snadno určit, na jaké kombinace a části souborů má být omezena konkrétní revize.

source: Here’s an example that hard-resets the master branch in your test repository to an older commit and then recovers the lost commits.
cs: Uvedeme příklad, při němž resetujeme hlavní větev v testovacím repozitáři na jednu ze starších revizí a poté ztracené revize obnovíme.

source: Here’s an example to give you an idea of what it would take to get a SHA-1 collision.
cs: Abyste si udělali představu, jak je nepravděpodobné, že dojde ke kolizi hodnot SHA-1, připojujeme jeden malý příklad.

source: Here’s an example.
cs: Uveďme malý příklad.

source: Here’s an example:
cs: Příklad:

source: Here’s how to do that:
cs: Udělá se to následovně:

source: Here’s the object SHA-1 value it created:
cs: Pro objekt byla vytvořena tato hodnota SHA-1:

source: Here’s what it looks like:
cs: Ten má následující podobu:

source: History after cherry-picking a commit on a topic branch.
cs: Historie po částečném převzetí revize z tematické větve

source: History with several topic branches.
cs: Historie s několika tematickými větvemi

source: Homebrew (`http://brew.sh/`) is another alternative to install Git.
cs: Dalším možným nástrojem pro instalaci Git je Homebrew (`http://brew.sh/`).

source: How can you easily unmodify it — revert it back to what it looked like when you last committed (or initially cloned, or however you got it into your working directory)?
cs: Jak je můžete snadno zrušit a vrátit soubor zpět do podoby při poslední revizi (nebo při prvním klonování nebo v jakémkoli okamžiku, kdy jste ho zaznamenali v pracovním adresáři)?

source: How can you keep your code consistently up to date and your patches valid?
cs: Jak lze důsledně udržovat kód aktuální a záplaty vždy platné?

source: How can you recover that commit at this point?
cs: Jak lze tedy v tuto chvíli ztracenou revizi obnovit?

source: How can you unstage one of the two?
cs: Jak lze tyto dva soubory vrátit z oblasti připravených změn?

source: How does Git do this?
cs: Jak to Git dělá?

source: How does Git know what branch you’re currently on?
cs: Jak Git pozná, na jaké větvi se právě nacházíte?

source: How is that possible?
cs: Jak je tohle možné?

source: How many users are actively contributing code to this project, and how often?
cs: Kolik uživatelů aktivně přispívá kódem do projektu a jak často?

source: How much work are you contributing at a time?
cs: Kolik práce představuje jeden váš příspěvek?

source: How often do you contribute?
cs: A jak často přispíváte?

source: How you name the keys determines how you refer to the users in the `gitosis.conf` file.
cs: Jak tyto klíče pojmenujete, závisí na tom, jak jsou uživatelé označeni v souboru `gitosis.conf`.

source: However, Git has to check out each version, one at a time, and commit it individually.
cs: Git však musí provést checkout každé verze jednotlivě a po jedné je také zapsat.

source: However, Git is pretty smart about figuring that out after the fact — we’ll deal with detecting file movement a bit later.
cs: Git však používá jinou fintu, aby zjistil, že byl soubor přejmenován. Na ni se podíváme později.

source: However, Gitolite allows another permission: `-`, standing for "deny".
cs: Ale Gitolite dovoluje nastavení dalšího oprávnění: `-` s významem „odmítnutí“.

source: However, `git svn` assumes that you won’t have multiple remotes and saves all its references to points on the remote server with no namespacing.
cs: Příkaz `git svn` však předpokládá, že nebudete mít více vzdálených repozitářů a všechny odkazy na místa na vzdáleném serveru uloží bez použití jmenného prostoru.

source: However, `strings` is available on most Mac and Linux systems, so it may be a good first try to do this with many binary formats.
cs: Nicméně program `strings` je k dispozici na většině operačních systémů Mac a Linux, takže může jít o dobrou první volbu při pokusech s celou řadou binárních souborů.

source: However, any language will work fine.
cs: Stejně dobře však pochodíte i s jakýmkoli jiným jazykem.

source: However, anything you lose that was never committed is likely never to be seen again.
cs: Pokud však dojde ke ztrátě dat, která dosud nebyla součástí žádné revize, bude tato ztráta patrně nevratná.

source: However, because no alternates are listed in this case, your object must be in a packfile.
cs: Protože však seznam v tomto případě neobsahuje žádné alternativní repozitáře, váš objekt musí být v balíčkovém souboru.

source: However, before you do that, note that if your working directory or staging area has uncommitted changes that conflict with the branch you’re checking out, Git won’t let you switch branches.
cs: Než tak učiníte, zkontrolujte, zda nemáte v pracovním adresáři nebo v oblasti připravených změn nezapsané změny, které kolidují s větví, jejíž checkout provádíte. V takovém případě by vám Git přepnutí větví nedovolil.

source: However, first you’ll delete the `hotfix` branch, because you no longer need it — the `master` branch points at the same place.
cs: Nejprve však smažete větev `hotfix`, kterou teď už nebudete potřebovat – větev `master` ukazuje na totéž místo.

source: However, if it’s possible to move to a real Git server, doing so can gain your team a lot more.
cs: Stále však platí, že pokud máte možnost přejít na skutečný server Git, získáte vy i váš tým daleko více.

source: However, if someone at any point in the history of your project added a single huge file, every clone for all time will be forced to download that large file, even if it was removed from the project in the very next commit.
cs: Je jí fakt, že příkaz `git clone` stáhne vždy celou historii projektu, všechny verze všech souborů.

source: However, if someone uploaded a patch file generated via `format-patch` to a ticketing system or something similar, you can save the file locally and then pass that file saved on your disk to `git am` to apply it:
cs: Pokud však někdo nahrál soubor záplaty vygenerovaný příkazem `format-patch` do tiketového nebo podobného systému, můžete soubor uložit lokálně a poté na tento uložený soubor použít příkaz `git am`. Tímto způsobem záplatu aplikujete:

source: However, if there are too many loose objects (objects not in a packfile) or too many packfiles, Git launches a full-fledged `git gc` command.
cs: Pokud však identifikuje příliš mnoho volných objektů (objektů nezabalených do balíčkového souboru) nebo balíčkových souborů, spustí Git plnou verzi příkazu `git gc`.

source: However, if you can’t find a reference in the `refs` directory, it’s probably in your `packed-refs` file.
cs: Pokud však nemůžete najít některou z referencí v adresáři `refs`, bude patrně v souboru `packed-refs`.

source: However, if you want another file outside of your project to hold those values or have extra values, you can tell Git where that file is with the `core.excludesfile` setting.
cs: Pokud však chcete, aby tyto hodnoty obsahoval jiný soubor mimo projekt, nebo chcete určit dodatečné hodnoty, parametrem `core.excludesfile` můžete systému Git sdělit, kde má tento soubor hledat.

source: However, if your message contains the proper pattern, Git allows you to commit:
cs: Pokud však zpráva obsahuje správný vzor, Git vám umožní revizi zapsat:

source: However, if you’d like to remove the identifier, now is the time to do so — before you start doing work on the new repository.
cs: Pokud ale chcete identifikátor přesto odstranit, teď, dokud jste nezačali pracovat na novém repozitáři, je ta správná chvíle.

source: However, in order to do any collaboration in Git, you’ll need to have a remote Git repository.
cs: Abyste však mohli v systému Git spolupracovat s ostatními, budete potřebovat vzdálený repozitář Git.

source: However, it can be helpful sometimes when you need to see what’s really going on.
cs: Může se však hodit, až budete jednou potřebovat zjistit, co se doopravdy odehrává.

source: However, it can be very useful.
cs: Příkaz přesto může být velmi užitečný.

source: However, it’s an interesting exercise and can in theory help you avoid a rebase that you might later have to go back and fix.
cs: Skript je však zajímavým cvičením a teoreticky vám může pomoci předejít nutnosti vracet se v historii a přeskládávat revize kvůli opravě chyby.

source: However, keep in mind that to collaborate with a couple of people on a private project, all you _need_ is an SSH server and a bare repository.
cs: To však nemění nic na tom, že ke spolupráci se skupinou lidí na soukromém projektu _vystačíte_ s jedním SSH serverem a holým repozitářem.

source: However, let’s run `git status` one more time:
cs: Spusťme však ještě jednou příkaz `git status`:

source: However, many larger public projects accept patches via a developer mailing list, so I’ll go over an example of that now.
cs: U mnoha větších veřejných projektů se však záplaty doručují na základě poštovní konference vývojářů, a proto se teď zaměřím na tento případ.

source: However, maybe you want to run an external command, rather than a Git subcommand.
cs: Může se však stát, že budete chtít spustit externí příkaz, a ne dílčí příkaz Git.

source: However, occasionally Git packs up several of these objects into a single binary file called a packfile in order to save space and be more efficient.
cs: Při vhodných příležitostech však Git sbalí několik těchto objektů do jediného binárního souboru, jemuž se říká „balíčkový“ (packfile). Tento soubor šetří místo na disku a zvyšuje výkon.

source: However, scripts and hosted services may make this easier — it depends largely on how you develop and how your contributors develop.
cs: Situaci vám mohou usnadnit skripty a hostované služby. Do velké míry tu záleží na tom, jak vy a vaši vývojáři k vývoji přistupujete.

source: However, that isn’t convenient, so Git provides another shorthand for doing the same thing: the triple-dot syntax.
cs: To však není příliš pohodlný způsob, a proto Git nabízí jinou možnost, jak lze provést stejnou věc: trojtečkovou syntaxi.

source: However, that result is of limited use.
cs: Tento výsledek má však omezené použití.

source: However, the import isn’t perfect; and because it will take so long, you may as well do it right.
cs: Takový import však není úplně dokonalý a vzhledem k tomu, jak dlouho může trvat, nabízí se ještě jiná cesta.

source: However, the time-limiting options such as `--since` and `--until` are very useful.
cs: Velmi užitečné jsou naproti tomu časově omezující parametry, jako `--since` a `--until` („od“ a „do“).

source: However, there are other strategies you can choose as well.
cs: Existují však ještě další strategie.

source: However, there is another way: you can take the patch of the change that was introduced in C3 and reapply it on top of C4.
cs: Existuje však ještě jiný způsob. Můžete vzít záplatu se změnou, kterou jste provedli revizí C3, a aplikovat ji na vrcholu revize C4.

source: However, this is equivalent to running something like this:
cs: Výsledek je však stejný, jako byste provedli následující:

source: However, this setup also has some serious downsides.
cs: Avšak i tato koncepce má závažné nedostatky.

source: However, you can create and commit to branches in Subversion using `git svn`.
cs: Nicméně příkaz `git svn` vytváření větví a zapisování revizí do systému Subversion umožňuje.

source: However, you can inject text into a file when it’s checked out and remove it again before it’s added to a commit.
cs: Můžete však vložit text do souboru po jeho checkoutu a opět ho odstranit, než bude přidán do revize.

source: However, you can set up other tracking branches if you wish — ones that don’t track branches on `origin` and don’t track the `master` branch.
cs: Pokud chcete, můžete nastavit i jiné sledující větve – takové, které nebudou sledovat větve na serveru `origin` a nebudou sledovat hlavní větev `master`.

source: However, you can use namespacing to accomplish something like that.
cs: Místo nich však můžete využít možností jmenného prostoru.

source: However, you should be aware of how ridiculously unlikely this scenario is.
cs: Měli bychom však také říci, jak moc je nepravděpodobné, že taková situace nastane.

source: However, your reflog and a new set of refs that Git added when you did the `filter-branch` under `.git/refs/original` still do, so you have to remove them and then repack the database.
cs: Obsahuje ho však stále ještě reflog a v adresáři `.git/refs/original` také nová sada referencí, které Git přidal při spuštění příkazu `filter-branch`. Budete je proto muset odstranit a databázi znovu zabalit.

source: I found that learning this information was fundamentally important to understanding how useful and powerful Git is, but others have argued to me that it can be confusing and unnecessarily complex for beginners.
cs: Osobně se domnívám, že je tato informace velmi důležitá, aby uživatel pochopil, jak užitečný a výkonný je systém Git. Ostatní mi však oponovali, že pro začátečníky mohou být tyto informace matoucí a zbytečně složité.

source: I hope you can use your newfound knowledge of Git internals to implement your own cool application of this technology and feel more comfortable using Git in more advanced ways.
cs: Jsem přesvědčen, že vám nově nabyté znalosti interních principů systému Git pomohou implementovat vlastní užitečné aplikace této technologie a že se i v pokročilých funkcích systému Git budete cítit příjemněji.

source: I leave it up to you to decide.
cs: Rozhodnutí nechávám na vás.

source: I mentioned earlier that a header is stored with the content.
cs: Už jsem zmínil, že se spolu s obsahem ukládá také záhlaví (header).

source: I put Chapter 1 of this book into Git, added some text to a paragraph, and saved the document.
cs: Kapitolu 1 této knihy jsem vložil do systému Git, do jednoho odstavce jsem přidal kousek textu a dokument jsem uložil.

source: I used Ruby to write these, both because it’s my preferred scripting language and because I feel it’s the most pseudocode-looking of the scripting languages; thus you should be able to roughly follow the code even if you don’t use Ruby.
cs: Já jsem k napsání skriptů použil Ruby, zaprvé proto, že je to můj oblíbený skriptovací jazyk, zadruhé proto, že ho považuji za skriptovací jazyk, který nejvíce vypadá jako pseudokód. Díky tomu byste měli kód bez problému rozluštit, i když Ruby nepoužíváte.

source: If John, Josie, and Jessica all sign up for accounts on GitHub, and you want to give them push access to your repository, you can add them to your project as collaborators.
cs: Pokud si John, Josie i Jessica zaregistrují účty na serveru GitHub a vy jim chcete udělit oprávnění k odesílání dat do svého repozitáře, můžete je do svého projektu přidat jako spolupracovníky.

source: If `master` is a direct ancestor of your topic branch, this isn’t a problem; but if the two histories have diverged, the diff will look like you’re adding all the new stuff in your topic branch and removing everything unique to the `master` branch.
cs: Pokud je větev `master` přímým předkem vaší tematické větve, nebude s příkazem žádný problém. Pokud se však obě historie v nějakém bodě rozdělily, bude výpis diff vypadat, jako byste chtěli přidat všechna nová data v tematické větvi a odstranit vše, co je pouze ve větvi `master`.

source: If a match is found, the push succeeds.
cs: Jestliže je nalezen odpovídající záznam, odesílání je povoleno.

source: If a particular version of a file is in the Git directory, it’s considered committed.
cs: Nachází-li se konkrétní verze souboru v adresáři Git, je považována za zapsanou.

source: If a reference is not found under the `refs` directory, Git then searches for it in the `.git/packed-refs` file, which contains space separated SHA-1 path pairs, for example:
cs: Pokud se reference nenajde v adresáři `refs`, hledá ji Git v souboru `.git/packed-refs`. Ten obsahuje páry SHA-1 a cesta oddělené mezerou jako například:

source: If a user SSHs into a server and has write access to the `/opt/git/my_project.git` directory, they will also automatically have push access.
cs: Pokud se uživatel dostane přes SSH na server a má oprávnění k zápisu do adresáře `/opt/git/my_project.git`, má automaticky také oprávnění k odesílání dat.

source: If all 6.5 billion humans on Earth were programming, and every second, each one was producing code that was the equivalent of the entire Linux kernel history (1 million Git objects) and pushing it into one enormous Git repository, it would take 5 years until that repository contained enough objects to have a 50% probability of a single SHA-1 object collision.
cs: Kdyby 6,5 miliardy lidí na zemi programovalo a každý by každou sekundu vytvořil kód odpovídající celé historii linuxového jádra (1 milion objektů Git) a odesílal ho do jednoho obřího repozitáře Git, trvalo by 5 let, než by repozitář obsahoval dost objektů na to, aby existovala 50% pravděpodobnost, že dojde ke kolizi jediného objektu SHA-1.

source: If all your commit messages look like this, things will be a lot easier for you and the developers you work with.
cs: Budou-li takto vypadat všechny vaše zprávy k revizím, usnadníte tím práci sobě i svým spolupracovníkům.

source: If another developer makes changes to the rack code and commits, and you pull that reference down and merge it in, you get something a bit odd:
cs: Jestliže jiný vývojář provede změny v kódu adresáře rack a zapíše je do revize a vy poté tuto referenci stáhnete a začleníte, dostanete něco, co bude vypadat poněkud zvláštně:

source: If anyone wants to verify a tag, they can directly import your PGP key by pulling the blob directly out of the database and importing it into GPG:
cs: Bude-li chtít značku kdokoli ověřit, může přímo importovat váš klíč PGP tak, že stáhne blob z databáze a naimportuje ho do programu GPG:

source: If everything is cool, it fires up the `upload-pack` process and hands off the request to it.
cs: Je-li vše v pořádku, spustí démon Git proces `upload-pack` a předá mu svůj požadavek.

source: If it does, then it was introduced sometime before this middle commit; if it doesn’t, then the problem was introduced sometime after the middle commit.
cs: Pokud ano, vznikla chyba někdy před touto prostřední revizí; pokud ne, pak je problém záležitostí revizí zapsaných až po této prostřední revizi.

source: If it sees one that is reachable from one of your remote references, it aborts the rebase:
cs: Pokud najde revizi, která je dostupná z některé z vašich vzdálených referencí, proces přeskládání přeruší:

source: If it’s modified but has been added to the staging area, it is staged.
cs: Pokud je modifikovaná verze přidána do oblasti připravených změn, je považována za připravenou k zapsání.

source: If none of these tools works for you, you have a rarer tool, or you otherwise need a more custom importing process, you should use `git fast-import`.
cs: Pokud vám nevyhovuje ani jeden z těchto nástrojů, používáte méně častý nástroj, nebo potřebujete speciální proces importu ještě z jiného důvodu, použijte `git fast-import`.

source: If one developer clones, makes changes, and then tries to push their changes while another developer has pushed in the meantime, the server will reject that developer’s changes.
cs: Pokud některý z vývojářů naklonuje data, provede změny a poté se je pokusí odeslat, a jiný vývojář mezitím odeslal svoje revize, server tyto změny odmítne.

source: If she e-mails you again later with another branch containing another great feature, you can fetch and check out because you already have the remote setup.
cs: Pokud vám později opět pošle e-mail, že jiná větev obsahuje další skvělou funkci, můžete tuto větev vyzvednout a provést její checkout, protože už máte nastaven tento repozitář jako vzdálený.

source: If some of the changes modify the same file, try to use `git add --patch` to partially stage files (covered in detail in Chapter 6).
cs: Pokud některé změny modifikují tentýž soubor, zkuste použít příkaz `git add --patch` a připravit soubory k zapsání po částech (podrobnosti v kapitole 6).

source: If someone else pushes a change to one file and then you push a change to another file, your `dcommit` will work fine:
cs: Jestliže někdo odešle na server změnu v jednom souboru a vy poté odešlete změnu provedenou v jiném souboru, příkaz `dcommit` bude proveden úspěšně:

source: If someone has e-mailed you the patch properly using `git send-email`, and you download that into an mbox format, then you can point `git am` to that mbox file, and it will start applying all the patches it sees.
cs: Jestliže vám přispěvatel řádně poslal záplatu e-mailem pomocí příkazu `git send-email` a vy záplatu stáhnete do formátu mbox, můžete na soubor mbox použít příkaz `git am`, který začne aplikovat všechny záplaty, které najde.

source: If someone only has a single patch to contribute once in a while, then accepting it over e-mail may be less time consuming than requiring everyone to run their own server and having to continually add and remove remotes to get a few patches.
cs: Má-li někdo jen jednu záplatu, jíž chce právě teď přispět, bude rychlejší, pokud vám záplatu doručí e-mailem, než abyste všechny vývojáře nutili provozovat kvůli pár záplatám vlastní servery a pravidelně přidávat a odstraňovat vzdálené repozitáře.

source: If someone opens that tarball, they get the latest snapshot of your project under a project directory.
cs: Až někdo tento tarball otevře, získá nejnovější snímek vašeho projektu v projektovém adresáři.

source: If something is missing or the tests don’t pass, exiting non-zero also aborts the `git am` script without committing the patch.
cs: Jestliže je záplata neúplná nebo neprojde prováděnými testy, bude výstup skriptu nenulový, příkaz `git am` bude přerušen a revize nebude zapsána.

source: If that happens, you see an error like this:
cs: Pokud dojde k něčemu takovému, zobrazí se následující chyba:

source: If that is different, you must set the `$user` variable manually.
cs: Pokud nejsou uživatelé stejní, budete muset ručně nastavit proměnnou `$user`.

source: If that script is in place (in `.git/hooks/commit-msg`) and executable, and you commit with a message that isn’t properly formatted, you see this:
cs: Je-li skript na svém místě (`.git/hooks/commit-msg`) a je spustitelný, pak v případě, že zapíšete revizi se zprávou v nedovoleném formátu, zobrazí se následující:

source: If that server goes down for an hour, then during that hour nobody can collaborate at all or save versioned changes to anything they’re working on.
cs: Pokud takový server na hodinu vypadne, pak během této hodiny buď nelze pracovat vůbec, nebo přinejmenším není možné ukládat změny ve verzích souborů, na nichž uživatelé právě pracují.

source: If that works well, you can fast-forward your `master` branch, and you’ll end up with a linear project history.
cs: Pokud vše funguje, můžete větev `master` posunout rychle vpřed a výsledkem procesu bude lineární historie projektu.
